[
	{
		"id": "1",
		"title": "Goodbye, England !",
		"alt":"Dans une tasse de thé",
		"imageTitle":"Née au Royaume-Uni",
		"image": [
			{
			  "src":"https://i.ibb.co/pZCxfDq/tea1500.webp",
			  "srcSet": "https://i.ibb.co/0Bp63zc/tea400.webp 400w, https://i.ibb.co/7tMjmpq/tea600.webp 600w, https://i.ibb.co/hM2DTrS/tea1000.webp 1024w, https://i.ibb.co/pZCxfDq/tea1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text":"Il y a bien longtemps (enfin pas SI longtemps quand même) naquit, dans une contrée lointaine nommée Angleterre, une jeune fille qu’on décida d’appeler Julia. Pas d’explication à ce propos ; ses parents aimaient certainement juste ce prénom, mais Julia aima à croire que son prénom avait, en réalité, été inspiré du grand orateur et fin stratège Jules César… et que ce prénom avait été choisi sur mesure pour elle, pour l’ensemble de ses qualités (et elle en avait évidemment beaucoup !)  "
	},
	{
		"id": "2",
		"title": "Hello, France !",
		"alt":"Marinière et coq français",
		"imageTitle":"Expatriée en France",
		"image": [
			{
			  "src":"https://i.ibb.co/VvcNnLx/rooster1500.webp",
			  "srcSet": "https://i.ibb.co/pLB0td3/rooster400.webp 400w, https://i.ibb.co/0By52N9/rooster600.webp 600w, https://i.ibb.co/TcPfC4h/rooster1000.webp 1024w, https://i.ibb.co/VvcNnLx/rooster1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text":"A peine eut-elle 4 ans que ses parents décidèrent de quitter son Devon natal pour s’installer non loin de Rennes, en Bretagne. Julia intégra donc une classe de grande section, où elle apprit rapidement le français (et, bien sûr, aussi un peu les maths et tout le reste). Son expatriation lui apprit, par ailleurs, que nul n’est réellement voué à vivre l’intégralité de sa vie sous un ciel gris, avec pour seule alimentation du Cheddar orange, du jelly et du roast beef (Elle considère, toutefois, que quiconque vivrait avec de tels clichés mériterait de ne rien connaître d’autre que pluies et tempêtes).Elle, de son ôté, vivait BIEN ENTENDU sans aucun cliché. Elle acheta toutefois bientôt sa première marinière et apprit tout l’art de porter sa baguette sous le bras. Bien des années plus tard, elle commença même à apprécier un bon verre de vin rouge et à déguster les tommes de montagne. Seul point d’ombre au tableau : elle ne parvint jamais à se débarrasser de son humour douteux !"
	},
    {
		"id": "3",
		"title": "A vos marques, prêts, partez !",
		"alt":"En franchissant la ligne d'arrivée d'une course à pied",
		"imageTitle":"Une pratique sportive régulière",
		"image": [
			{
			  "src":"https://i.ibb.co/sQCfR2q/sport1500.webp",
			  "srcSet": "https://i.ibb.co/7rGzcqc/sport400.webp 400w, https://i.ibb.co/8YvMYTK/sport600.webp 600w, https://i.ibb.co/g3DY0Yj/sport1000.webp 1024w, https://i.ibb.co/sQCfR2q/sport1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text":"Aventurière dans l’âme et téméraire au possible, Julius (enfin Julia) ne se contenta pas de recevoir son Ossau Iraty par pigeon voyageur. Elle n'eut donc d'autre choix que de développer une passion pour la randonnée qui lui permit, du moins le crut-elle, de mériter amplement son fromage. D'ailleurs, malgré une épreuve de judo qui la laissa en larmes alors qu’elle n’avait que 8 ans, Julia resta compétitrice et, en plus de la randonnée, prit plaisir à pratiquer la course à pied, le kayak ou encore l’escalade. (A noter que le judo ne fit bizarrement plus partie de ses sports de prédilection) "
	},
    {
		"id": "4",
		"title": "Passion cuisine",
		"alt":"Toque sur la tête et saladier en main",
		"imageTitle":"Passion cuisine",
		"image": [
			{
			  "src":"https://i.ibb.co/CnFjdcd/baking1500.webp",
			  "srcSet": "https://i.ibb.co/W2kR8ym/baking400.webp 400w, https://i.ibb.co/mFvHkvh/baking600.webp 600w, https://i.ibb.co/PNdQPDT/baking1000.webp 1024w, https://i.ibb.co/CnFjdcd/baking1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text":"Comme bon nombre d’enfants de son âge, Julia vécut, assez tôt dans la vie, quelques expériences en cuisine qui lui apprirent, à ses dépens, quelques leçons de vie... Primo, on ne met les doigts dans le saladier lorsqu’on utilise un batteur électrique… Secundo, le feu, ça brûle. On ne retrouva donc plus jamais Julia sur un tatami ; on ne la vit plus jamais, non plus, remettre un pied en cuisine ! ERREUR ! Détrompez-vous ! Ces leçons lui furent bien utiles car Julia prit réellement goût à la cuisine et, en particulier à la pâtisserie. De ses premières mousses au chocolat à ses entremets tropicaux en passant par ses éclairs aux fruits rouges, Julia eut progressivement envie de s’inspirer des chefs pour trouver de nouvelles idées de plats et de desserts, lui permettant de recevoir ses proches comme il se doit (et, accessoirement aussi, de se faire plaisir)."
	},
	



    {
		"id": "5",		
		"alt":"Entourée de plantes",
		"imageTitle":"Passion jardinage",
		"title": "Cultivons notre jardin",
		"image": [
			{
			  "src":"https://i.ibb.co/hRGvpRZ/plants1500.webp",
			  "srcSet": "https://i.ibb.co/8mD7jSB/plants400.webp 400w, https://i.ibb.co/zZ5D40v/plants600.webp 600w, https://i.ibb.co/4tzvRj0/plants1000.webp 1024w, https://i.ibb.co/hRGvpRZ/plants1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text":"A l'image de Candide, Julia -dotée d’une sagesse à toute épreuve- aima également à cultiver son jardin. Des tulipes aux oeillets, en passant par les fuchsias et les coquelicots, Julia s'empara de tout espace pouvant accueillir quelques plantations afin d’y apporter un peu de couleur. N’ayant pas toujours la main verte, cette couleur put toutefois tendre parfois vers le marron, l'aventure s'achevant alors par un aller-simple vers la déchèterie. "
	},
    {
		"id": "6",
		"alt":"En train de jouer du saxophone",
		"imageTitle":"Saxophone en cours d'apprentissage",
		"title": "Ca joue !",
		"image": [
			{
			  "src":"https://i.ibb.co/rFTddb1/saxo1500.webp",
			  "srcSet": "https://i.ibb.co/W2kR8ym/baking400.webp 400w, https://i.ibb.co/C8ntXtF/saxo600.webp 600w, https://i.ibb.co/FxRNh4y/saxo1000.webp 1024w, https://i.ibb.co/rFTddb1/saxo1500.webp 1592w",
			  "sizes": "(max-width: 400px) 400px, (max-width: 600px) 600px, (max-width: 1024px) 1000px, (min-width: 1025px) 100vw"
			}
		  ],
		"text": "Aimant l’idée de s’improviser musicienne (et s’inspirant probablement de quelques orchestres en plein air qu’elle a beaucoup appréciés), Julia s’équipa, sur le tard, d’un saxophone alto. Nul ne sait si elle eut, un jour, l’occasion d’informer son voisinage que le morceau qu’elle jouait était une composition de Yiruma. L’histoire s’achève d'ailleurs sur cette interrogation...😧"
	}
]

