[
	{
		"id": "1",
		"title": "Gestion de projets",
		"image": "https://i.ibb.co/KqDDL6R/ons-project-management-color-line-34.webp" ,
		"text":"Les sept années que j'ai passées au sein de l'Education Nationale ont été l'occasion pour moi de développer ma capacité à gérer des projets de A à Z. En particulier, j'ai pu mener plusieurs projets théâtre. A partir d'une thématique définie, j'ai rédigé des pièces et créé des chansons, accompagné mes élèves pour mettre en scène les pièces en question, défini les décors nécessaires et aidé mes élèves à les réaliser. Une fois le projet avancé, il a fallu organiser la représentation en définissant un lieu et en veillant au respect des réglementations, avant d'assurer le bon déroulement du spectacle. "
	},
    {
		"id": "2",
		"title": "Capacité d'adaptation",
		"image": "https://i.ibb.co/XsbxbJk/ons-project-management-color-line-36.webp" ,
		"text":"La crise du COVID a été l'une des occasions où j'ai pu démontrer ma capacité d'adaptation ainsi que ma réactivité. Ayant appris le vendredi soir la fermeture des écoles, j'ai rapidement développé un site Wordpress afin de maintenir le lien avec les familles et proposer des ressources ludiques et intéressantes à mes élèves de moyenne section et grande section durant toute la durée de fermeture des établissements scolaires. Par ailleurs, ma capacité d'adaptation m'a également été très utile lorsque j'ai accueilli un élève non-lecteur et peu scolarisé au sein de ma classe de CM. En parallèle des autres apprentissages, je suis parvenue à apprendre à cet élève à lire et à écrire. J'ai également réussi à lui donner envie d'apprendre et à prendre progressivement confiance en ses capacités."
	},
    {
		"id": "3",
		"title": "Capacité à apprendre",
		"image": "https://i.ibb.co/X4vDJvh/ons-project-management-color-line-62.webp" ,
		"text":"Enseigner nécessite d'être polyvalent, mais aussi de savoir apprendre en continu. Ayant enseigné de la petite section au CM2 en passant par l'ULIS, j'ai eu des élèves de 2 à 11ans. Il m'a fallu, pour chaque niveau enseigné, m'approprier en profondeur des notions très variées: à titre d'exemple, cela peut aller du système solaire à l'âge industriel en passant par l'énergie et les valeurs de la République et de l'Union Européenne. Convaincue de la nécessité de bien comprendre ce que l'on enseigne, j'ai souvent travaillé de manière très consciencieuse les notions d'histoire, géographie, sciences et arts avant de proposer chacune de mes séquences en classe. Curieuse et intéressée, je trouvais que cela faisait partie des richesses du métier... même si c'était inévitablement très consommateur en temps."
	},
    {
		"id": "4",
		"title": "Capacité à travailler en équipe",
		"image": "https://i.ibb.co/HYqRLVb/cons-project-management-color-line-7.webp" ,
		"text":"En tant qu'enseignant, on travaille énormément en autonomie; on travaille pourtant également souvent en équipe. Au cours de la dernière année que j'ai passée au sein de l'Education Nationale, j'ai pu travailler de manière régulière avec un enseignant référent pour les enfants du voyage. Je travaillais également avec les professionnels qui oeuvraient au service de mes élèves (orthophoniste, ergothérapeute, psychologue, psychomotricien etc.). Les parents étaient des partenaires avec lesquels j'ai beaucoup apprécié travailler, tout comme les collègues avec lesquels plusieurs projets communs ont pu être montés. Enfin, en tant qu'enseignant, on travaille également avec les institutions telles que les Inspections de circonscription, les psychologues scolaires, les maires et chargés des affaires scolaires ou encore les agents périscolaires. "
	},
    {
		"id": "5",
		"title": "Créativité",
		"image": "https://i.ibb.co/nCtm6zR/ons-project-management-color-line-15.webp" ,
		"text":"Lorsque j'enseignais, j'avais à coeur que mes élèves soient heureux de venir à l'école et qu'ils continuent à cultiver cette envie d'apprendre que l'on retrouve souvent chez les très jeunes enfants et qui a tendance, malheureusement, à se perdre par la suite. J'avais également pour objectif de permettre à chaque élève, qu'importe ses difficultés ou ses facilités, de développer son potentiel et de gagner en assurance personnelle. J'essayais donc de faire preuve d'ingéniosité, et d'une bonne quantité de mise en scène afin de parvenir à ces objectifs. Au jour le jour, je veillais à instaurer, aussi souvent que possible, une véritable pédagogie de projet. Celle-ci nous a d'ailleurs conduits, entre autres, à créer de petits bateaux à voile ou encore à l'instauration d'un lombricomposteur. J'ai également mis en place, une fois par an, une journée des talents. Celle-ci a toujours connu un franc succès et a permis, très régulièrement, de mettre en lumière des élèves qui manquaient cruellement de confiance en eux. "
	}
]